trabalho/app/Controllers/Admin/Registro.php

    public function index(){
        $registroModel = new RegistroModel();
        $dados["estacionamento"] = $registroModel->findAll();
---
SELECT *
FROM `estacionamento`

    public function registrar(){
            $modelRegistro = new RegistroModel();
            $dadosEnviados = $this->request->getPost();
            $dados["estacionamento"] = $modelRegistro->findAll();
            if($modelRegistro->save($dadosEnviados)){
---
INSERT INTO `estacionamento` (`placa_veiculo`, `veiculo`, `valor_hora`) VALUES ('lgkt029', 'carro', '20.00')